InformationRegisters/сфпПравилаЗаписиТелефонныхПереговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>сфпПравилаЗаписиТелефонныхПереговоров</Name>
			<Comment>Правила записи телефонных переговоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВнТелефона</Name>
					<Comment>Номер внутреннего телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Comment>Контакт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сфпДоступныеДляПрослушиванияПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>сфпДоступныеДляПрослушиванияПользователи</Name>
			<Comment>Пользователи, доступные для прослушивания телефонных переговоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Comment>Это группа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемыйПользователь</Name>
					<Comment>Контролируемый пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ИспользуемыйСофтФон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ИспользуемыйСофтФон</Name>
			<Comment>Используемый СофтФон</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СофтФон2</Name>
					<Comment>СофтФон, Проф 2.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СофтФонПроф</Name>
					<Comment>СофтФон, Проф</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СофтФон3</Name>
					<Comment>СофтФон, Проф 3.1</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВходящееИсходящееСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВходящееИсходящееСобытие</Name>
			<Comment>Входящее исходящее событие</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/сфпСофтФонПроКлиент/Ext/Module.bsl
/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",строка 1,,,строка 2", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" строка1   строка 2", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция сфпРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции // сфпРазложитьСтрокуВМассивПодстрок()

/////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫПОЛНЕНИЯ ЗВОНКА 

// Процедура выполняет звонок после выбора номера телефона
//
// Параметры:
//	СписокОбъектов			- СписокЗначений	- Список объектов, для которых выбираются телефоны
//	ИдентификаторСобытия	- Строка			- Уникальный идентификатор события
//
Процедура сфпПозвонитьВыбравТелефон(СписокОбъектов, ИдентификаторСобытия = "") Экспорт
	Если сфпПроверитьДоступностьСофтФона() Тогда
		сфпФормаТелефонВнешняяПанель.ПозвонитьВыбравТелефон(СписокОбъектов, ИдентификаторСобытия);
	КонецЕсли;
КонецПроцедуры // сфпПозвонитьВыбравТелефон()	

// Процедура выполняет звонок после выбора номера телефона
//
// Параметры:
//	Телефон					- Строка			- Номер телефона
//	Объект					- СправочникСсылка	- Контакт
//	ИдентификаторСобытия	- Строка			- Уникальный идентификатор события
//
Процедура сфпПозвонить(Телефон, Объект, ИдентификаторСобытия = "") Экспорт
	Если сфпПроверитьДоступностьСофтФона() Тогда
		сфпФормаТелефонВнешняяПанель.Позвонить(Телефон, Объект, ИдентификаторСобытия);
	КонецЕсли;
КонецПроцедуры // сфпПозвонить()	

// Процедура вызывается из карточек тех объектов, у которых необходимо набрать номер
//
// Параметры:
//	СтруктураНомера	- Структура	- Структура номера телефона
//
Процедура сфпНабратьНомерКИ(СтруктураНомера) Экспорт
	СтруктураТелефона = сфпСформироватьСтруктуруНомераИзПолей(СтруктураНомера);
	Если сфпПроверитьДоступностьСофтФона() Тогда
		сфпФормаТелефонВнешняяПанель.Позвонить(СтруктураТелефона.Представление, СтруктураНомера.Объект);
	КонецЕсли;
КонецПроцедуры // сфпНабратьНомерКИ()

// Процедура набора номера
Процедура сфпПозвонитьПоНомеру(ДанныеКИ) Экспорт
	Если НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеПоУмолчаниюПользователя("ИспользоватьСофтФон") Тогда Возврат; КонецЕсли;
	Попытка
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Объект",			ДанныеКИ.Объект);
		СтруктураПоиска.Вставить("Представление",	ДанныеКИ.Представление);
		СтруктураПоиска.Вставить("Тип",				ДанныеКИ.Тип);
	Исключение
		СтруктураПоиска  = Неопределено;
	КонецПопытки;
	Если СтруктураПоиска = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ (СтруктураПоиска.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")) Тогда
		Возврат;
	КонецЕсли;
	ТекАТС = Константы.CRM_ИспользуемыйСофтФон.Получить();
	Если ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФон2 Тогда
		сфпПозвонить(СтруктураПоиска.Представление, СтруктураПоиска.Объект);	
	ИначеЕсли (ТекАТС = Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф) И НЕ (РарусСофтФонПроф = Неопределено) Тогда
		СтруктураКИ = сфпСофтФонПроСервер.сфпНайтиОбъектВРегистреПоДанным(СтруктураПоиска);
		Если СтруктураКИ = Неопределено Тогда Возврат; КонецЕсли;	
		РарусСофтФонПроф.НабратьНомерКИ(СтруктураКИ);
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////
// СОФТФОН

// Процедура переподключает панели СофтФона
//
// Параметры:
//	ВыводитьПредупреждения	- Булево	- Признак вывода предупреждений
//
Процедура сфпПереподключитьСофтФон(ВыводитьПредупреждения = Истина) Экспорт
	Если НЕ (сфпФормаТелефонВнешняяПанель = Неопределено) И сфпФормаТелефонВнешняяПанель.Открыта() Тогда
		сфпФормаТелефонВнешняяПанель.Закрыть();
	КонецЕсли;	
	сфпФормаТелефонВнешняяПанель = Неопределено;
	ПанельСофтФон = Неопределено;
	#Если ВебКлиент Тогда
	Состояние(Нстр("ru = 'Работа СофтФона невозможна в web-клиенте!'"));
	#Иначе
	Если сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
		Если сфпСофтФонПроСервер.сфпПолучитьЗначениеПоУмолчаниюПользователя("ИспользоватьСофтФон") Тогда
			РезультатПодключения = Ложь;
			Попытка
				сфпФормаТелефонВнешняяПанель = ПолучитьФорму("Обработка.сфпСофтФонВнешняяПанель.Форма.Форма");
				РезультатПодключения = сфпФормаТелефонВнешняяПанель.Подключиться();
			Исключение
			КонецПопытки;
			Если НЕ РезультатПодключения Тогда
				сфпОткрытьФормуОшибкиПодключения("СофтФон", Нстр("ru = 'Не удалось подключиться к внешней панели СофтФон'"));
			КонецЕсли;
		Иначе
			Если ВыводитьПредупреждения Тогда
				Предупреждение(НСтр("ru = 'В персональных настройках пользователя отключено использование СофтФон'"));
			Иначе
				Состояние(НСтр("ru = 'В персональных настройках пользователя отключено использование СофтФон'"));
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Если ВыводитьПредупреждения Тогда
			Предупреждение(НСтр("ru = 'В настройках системы отключено использование СофтФон'"));
		Иначе
			Состояние(НСтр("ru = 'В настройках системы отключено использование СофтФон'"));
		КонецЕсли;	
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры // сфпПереподключитьСофтФон()	

// Функция проверяет доступность использования СофтФона
//
// Параметры:
//	ВыводитьПредупреждения	- Булево	- Признак вывода предупреждений
//
// Возвращаемое значение:
//	Булево	- Доступность СофтФона
//
Функция сфпПроверитьДоступностьСофтФона(ВыводитьПредупреждения = Истина) Экспорт
	#Если ВебКлиент Тогда
		Состояние(Нстр("ru = 'Работа СофтФона невозможна в web-клиенте!'"));
		Возврат Ложь;
	#Иначе
		Если НЕ сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
			Если ВыводитьПредупреждения Тогда
				Предупреждение(НСтр("ru = 'В настройках системы отключено использование СофтФон'"));
			КонецЕсли;	
			Возврат Ложь;
		ИначеЕсли НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеПоУмолчаниюПользователя("ИспользоватьСофтФон") Тогда	
			Если ВыводитьПредупреждения Тогда
				Предупреждение(НСтр("ru = 'В персональных настройках пользователя отключено использование СофтФон'"));
			Иначе
				Состояние(НСтр("ru = 'В персональных настройках пользователя отключено использование СофтФон'"));
			КонецЕсли;	
			Возврат Ложь;
		ИначеЕсли сфпФормаТелефонВнешняяПанель = Неопределено Тогда
			Если ВыводитьПредупреждения Тогда
				Предупреждение(НСтр("ru = 'Отсутствует подключение к серверу СофтФона'"));
			Иначе
				Состояние(НСтр("ru = 'Отсутствует подключение к серверу СофтФона'"));
			КонецЕсли;	
			Возврат Ложь;
		КонецЕсли;	
		Возврат Истина;
	#КонецЕсли
КонецФункции // сфпПроверитьДоступностьСофтФона()	

// Процедура открывает форму ошибки подключения
//
// Параметры:
//	ВидФормы	- Строка	- Вид формы ошибки подключения
//	ТекстОшибки	- Строка	- Текст ошибки
//
Процедура сфпОткрытьФормуОшибкиПодключения(ВидФормы, ТекстОшибки = "") Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидФормы",		ВидФормы);	
	ПараметрыФормы.Вставить("ТекстОшибки",	ТекстОшибки);
	ФормаОшибкиПодключения = ПолучитьФорму("ОбщаяФорма.CRM_СообщенияПодключения", ПараметрыФормы);
	Если ФормаОшибкиПодключения = Неопределено Тогда
		Возврат;
	ИначеЕсли ФормаОшибкиПодключения.Открыта() Тогда
		ФормаОшибкиПодключения.Активизировать();
	Иначе
		ФормаОшибкиПодключения.Открыть();
	КонецЕсли;
КонецПроцедуры // сфпОткрытьФормуОшибкиПодключения()

/////////////////////////////////////////////////
// ЗВОНОК

// Функция проверяет строку на пустоту
//
// Параметры:
//	ВыбСтрока		- Строка	- Проверяемая строка
//	ПризнакЗапятой  - Булево	- Признак добавления запятой
//
// Возвращаемое значение:
//	Строка	- Строка после проверки
//
Функция сфпПроверкаПустойСтроки(ВыбСтрока, ПризнакЗапятой = Истина) Экспорт
	Если ПустаяСтрока(ВыбСтрока) Тогда
		Возврат "";
	Иначе
		Возврат ?(ПризнакЗапятой, ",", "") + " ";
	КонецЕсли; 
КонецФункции // сфпПроверкаПустойСтроки()

// Функция определяет внутренний или внешний звонок исходя
//  из длины переданного номера телефона, и максимальной длины внутреннего номера 
//  телефона установленного в системе. Если длина номера > 0 И <= макс, то это внутренний
//
// Параметры:
//	НомерТелефона						- Строка	- Номер телефона
//	МаксимальнаяДлинаВнутреннегоНомера	- Число		- Максимальная длина внутреннего номера
//
// Возвращаемое значение:
//	Булево	- Признак внутреннего звонка
//
Функция сфпОпределитьВнутреннийЗвонокПоНомеру(НомерТелефона, МаксимальнаяДлинаВнутреннегоНомера) Экспорт
	НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
	ДлинаНомераТелефона = СтрДлина(НомерТелефона);
	Возврат (ДлинаНомераТелефона <= МаксимальнаяДлинаВнутреннегоНомера);
КонецФункции // сфпОпределитьВнутреннийЗвонокПоНомеру()

// Функция формирует структуру телефонного звонка по контактной информации,
//  если значение неопределено, то создает пустую структуру, сделано для удобства
//  создание структуры в одном месте
//
// Параметры:
//	ТекущаяСтрока	- СтрокаТабличнойЧасти	- Строка контактной информации
//
// Возвращаемое значение:
//	СтруктураНомера	- Структура телефонного номера
//
Функция сфпСформироватьСтруктуруНомераИзПолей(ТекущаяСтрока = Неопределено) Экспорт
	СтруктураТелефона = Новый Структура;
	Если ТекущаяСтрока = Неопределено Тогда
		СтруктураТелефона.Вставить("КодСтраны",     	"");
		СтруктураТелефона.Вставить("КодГорода",     	"");
		СтруктураТелефона.Вставить("НомерТелефона", 	"");
		СтруктураТелефона.Вставить("Внутренний",    	"");
		СтруктураТелефона.Вставить("Представление",		"");
	Иначе
		//СтруктураТелефона = сфпПреобразоватьСтрокуВСписокПолей(ТекущаяСтрока.ЗначенияПолей);
		СтруктураТелефона.Вставить("КодСтраны",		ТекущаяСтрока.Поле1);
		СтруктураТелефона.Вставить("КодГорода",		ТекущаяСтрока.Поле2);
		СтруктураТелефона.Вставить("НомерТелефона",	ТекущаяСтрока.Поле3);
		СтруктураТелефона.Вставить("Внутренний",	ТекущаяСтрока.Поле4);
		СтруктураТелефона.Вставить("Представление", "");
	КонецЕсли;
	сфпСформироватьПредставлениеТелефонаПоСтруктуре(СтруктураТелефона);
	Возврат СтруктураТелефона;
КонецФункции // сфпСформироватьСтруктуруНомераИзПолей()	

// Функция преобразывает строку полей в список значений
//
// Параметры:
//	СтрокаПолей	- Строка	- Строка, содержащая контактную информацию
//
// Возвращаемое значение:
//	СписокЗначений	- Список полей контактной информации
//
Функция сфпПреобразоватьСтрокуВСписокПолей(СтрокаПолей) Экспорт 
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	Для Сч = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		Стр = СтрПолучитьСтроку(СтрокаПолей, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(Стр, 2);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(Стр, Поз+1), Лев(Стр, Поз-1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции // сфпПреобразоватьСтрокуВСписокПолей()

// Процедура формирует строковое представление адреса
//
// Параметры:
//	СтруктураТелефона	- Структура	- Структура телефонного номера
//
Процедура сфпСформироватьПредставлениеТелефонаПоСтруктуре(СтруктураТелефона) Экспорт
	// Если не заполнены поля НомерТелефона и Внутренний номер,
	//  то принудительно скидываем представление, потому что код страны и код города 
	//  это явно мало для создания номера.
	Если ПустаяСтрока(СтруктураТелефона.НомерТелефона) И ПустаяСтрока(СтруктураТелефона.Внутренний) Тогда
		СтруктураТелефона.КодСтраны = "";
		СтруктураТелефона.КодГорода = "";
		СтруктураТелефона.Представление = "";
		Возврат;
	КонецЕсли;
	// Подкорректируем номер телефона, если заполнен внутренний номер и не заполнен номер телефона,
	//  то это точно не Внутренний номер, а следовательно удаляем код страны и код города
	Если ПустаяСтрока(СтруктураТелефона.НомерТелефона) И НЕ ПустаяСтрока(СтруктураТелефона.Внутренний) Тогда
		СтруктураТелефона.КодСтраны = "";
		СтруктураТелефона.КодГорода = "";
		СтруктураТелефона.Представление = "";
	КонецЕсли;
	СтруктураТелефона.Представление = СтруктураТелефона.КодСтраны;
	СтруктураТелефона.Представление = СтруктураТелефона.Представление 
		+ ?((НЕ ПустаяСтрока(СтруктураТелефона.КодГорода)),
		(сфпПроверкаПустойСтроки(СтруктураТелефона.Представление, Ложь) + "(" + СтруктураТелефона.КодГорода + ")"), "");
	СтруктураТелефона.Представление = СтруктураТелефона.Представление 
		+ ?((НЕ ПустаяСтрока(СтруктураТелефона.НомерТелефона)),
		(сфпПроверкаПустойСтроки(СтруктураТелефона.Представление, ПустаяСтрока(СтруктураТелефона.КодГорода))
		+ СтруктураТелефона.НомерТелефона),"");
	Если НЕ ПустаяСтрока(СтруктураТелефона.Представление) Тогда
		СтруктураТелефона.Представление = СтруктураТелефона.Представление
			+ ?((НЕ ПустаяСтрока(СтруктураТелефона.Внутренний)),(сфпПроверкаПустойСтроки(СтруктураТелефона.Представление)
			+ "доб. " + СтруктураТелефона.Внутренний), "");
	Иначе
		СтруктураТелефона.Представление = СтруктураТелефона.Внутренний;
	КонецЕсли;
КонецПроцедуры // сфпСформироватьПредставлениеТелефонаПоСтруктуре()

/////////////////////////////////////////////////
// КОНТАКТНАЯ ИНФОРМАЦИЯ

// Функция возвращает список телефонов объектов из списка
//
// Параметры:
//	СписокОбъектов	- СписокЗначений	- Список объектов, для которых выбираются телефоны
//
// Возвращаемое значение:
//	СписокЗначений	- Список телефонов объектов
//
Функция сфпЗаполнитьСписокТелефонов(СписокОбъектов) Экспорт
	СписокТелефонов = Новый СписокЗначений;
	ТекКонтакт = "";
	Для Каждого СтрокаКонтакт Из СписокОбъектов Цикл
		ТелефоныКонтакта = сфпСофтФонПроСервер.сфпПолучитьСписокТелефоновИФаксов(СтрокаКонтакт.Значение);
		Для Каждого Телефон Из ТелефоныКонтакта Цикл
			Значение = Новый Структура;
			Значение.Вставить("Контакт", СтрокаКонтакт.Значение);
			Значение.Вставить("Телефон", Телефон.Представление);
			Если НЕ (ТекКонтакт = СтрокаКонтакт.Значение)Тогда
				СписокТелефонов.Добавить(Значение, СокрЛП(СтрокаКонтакт.Значение));
				ТекКонтакт = СтрокаКонтакт.Значение;
			КонецЕсли;
			СписокТелефонов.Добавить(Значение, "  " + СокрЛП(Телефон.Вид) + ": " + Телефон.Представление);
		КонецЦикла;
	КонецЦикла;
	Возврат СписокТелефонов;
КонецФункции // сфпЗаполнитьСписокТелефонов()

// Функция определяет контакт по номеру телефона
//
// Параметры:
//	НомерТелефона	- Строка	- Номер телефона контакта
//	ВыбратьПервый	- Булево	- Признак возврата первого контакта без выбора из списка
//
// Возвращаемое значение:
//	СправочникСсылка	- Контакт
//
Функция сфпОпределитьКонтактПоНомеруТелефона(НомерТелефона, ВыбратьПервый = Ложь) Экспорт
	МассивЗвонящих = сфпСофтФонПроСервер.сфпНайтиОбъектВРегистреПоТелефону(НомерТелефона);
	СписокКонтактов = Новый СписокЗначений;
	Для Каждого Контакт Из МассивЗвонящих Цикл
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Контакт.ВедушийКонтрагент) Тогда
			СписокКонтактов.Добавить(Контакт, Строка(Контакт) + " <" + Строка(Контакт.ВедушийКонтрагент) + ">");
		Иначе
			СписокКонтактов.Добавить(Контакт, Строка(Контакт));
		КонецЕсли;	
	КонецЦикла;
	Если СписокКонтактов.Количество() = 0 Тогда
		Контакт = Неопределено;
	ИначеЕсли СписокКонтактов.Количество() = 1 Тогда
		Контакт = СписокКонтактов[0].Значение;	
	ИначеЕсли ВыбратьПервый Тогда
		Контакт = СписокКонтактов[0].Значение;	
	Иначе	
		ВыбранныйЭлемент = СписокКонтактов.ВыбратьЭлемент(НСтр("ru='Выберите контакт для номера '") + НомерТелефона);
		Если ВыбранныйЭлемент = Неопределено Тогда
			Контакт = Неопределено;
		Иначе	
			Контакт = ВыбранныйЭлемент.Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат Контакт;
КонецФункции // сфпОпределитьКонтактПоНомеруТелефона()

/////////////////////////////////////////////////
// МАРШРУТИЗАЦИЯ

// Процедура сохраняет изменение маршрутизации при записи документа
//
// Параметры:
//	Ссылка			- ДокументСсылка	- Ссылка на документ
//	Ответственный	- СправочникСсылка	- Ответственный
//
Процедура ИзменениеМаршрутизацииПриЗаписиДокумента(Ссылка, Ответственный) Экспорт
	Контакт = сфпСофтФонПроСервер.сфпПолучитьКонтактноеЛицоИлиПартнера(Ссылка);
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда Возврат; КонецЕсли;
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЕстьВзаимодействия = сфпСофтФонПроСервер.сфпЕстьВзаимодействияПоПользователю(Ссылка);
		Если ЕстьВзаимодействия Тогда
			сфпСофтФонПроСервер.сфпИзменитьТаблицуМаршрутизации(Контакт, Ответственный);
			// Обновим таблицу маршрутизации
			Если НЕ (сфпФормаТелефонВнешняяПанель = Неопределено) Тогда
				сфпФормаТелефонВнешняяПанель.ИзменитьМаршрутизациюВАТС(Ответственный);
			КонецЕсли;	
			// Изменим пользователя
			сфпСофтФонПроСервер.сфпИзменитьПользователяДляПереключенияЗвонков(Контакт, Ответственный);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ИзменениеМаршрутизацииПриЗаписиДокумента()

/////////////////////////////////////////////////
// ЗАПИСЬ ТЕЛЕФОННЫХ ПЕРЕГОВОРОВ

// Процедура открывает форму регистра правил записи телефонных переговоров
//
// Параметры:
//	Нет.
//
Процедура сфпОткрытьПравилаЗаписиТелефонныхПереговоров() Экспорт
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда Возврат; КонецЕсли;
	ФормаНастройкиПравил = ПолучитьФорму("РегистрСведений.сфпПравилаЗаписиТелефонныхПереговоров.ФормаСписка");
	Если ФормаНастройкиПравил = Неопределено Тогда Возврат; КонецЕсли;
	Если ФормаНастройкиПравил.Открыта() Тогда
		ФормаНастройкиПравил.Активировать();
	Иначе	
		ФормаНастройкиПравил.Открыть();
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьПравилаЗаписиТелефонныхПереговоров()

// Процедура открывает форму регистра разрешений на прослушивание телефонных переговоров
//
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь, для которого настраивабтся разрешения
//
Процедура сфпОткрытьПрослушиваемыхПользователей(Пользователь) Экспорт
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("Владелец", Пользователь);
	ФормаНастройкиДоступа = ПолучитьФорму("РегистрСведений.сфпДоступныеДляПрослушиванияПользователи.ФормаСписка", ПараметрыФормы);
	Если ФормаНастройкиДоступа = Неопределено Тогда Возврат; КонецЕсли;
	Если ФормаНастройкиДоступа.Открыта() Тогда
		ФормаНастройкиДоступа.Активировать();
	Иначе	
		ФормаНастройкиДоступа.Открыть();
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьПрослушиваемыхПользователей()

// Функция возвращает имя временного файла, в который выгружается запись разговора,
// полученная с сервера СофтФона
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Строка	- Имя файла для сохранения записи разговора
//
Функция ПолучитьИмяФайлаЗаписиРазговора() Экспорт
	// Определяем путь к файлу для сохранение записи разговора
	ИмяКаталога = "c:\";
	#Если НЕ ВебКлиент Тогда
	ИмяКаталога = КаталогВременныхФайлов();
	#КонецЕсли
	Возврат  (ИмяКаталога + "softphone.wav");
КонецФункции // ПолучитьИмяФайлаЗаписиРазговора()		

/////////////////////////////////////////////////
// СИСТЕМА ЗАПИСИ ТЕЛЕФОННЫХ ПЕРЕГОВОРОВ CLON

// Процедура выполняет отключение от сервера CLON
//
// Параметры:
//	Нет.
//
Процедура сфпОтключитьCLON() Экспорт
	Если сфпObjCLON = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		сфпObjCLON.Disconnect();				
	Исключение
	КонецПопытки;
	сфпObjCLON = Неопределено;
КонецПроцедуры // сфпОтключитьCLON()

// Функция выполняет подключение к серверу CLON
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Булево	- Результат подключения
//
Функция сфпПодключитьCLON() Экспорт
	#Если ВебКлиент Тогда
		Состояние(НСтр("ru='Работа СофтФона невозможна в web-клиенте!'"));
		Возврат Ложь;
	#Иначе
		сфпОтключитьCLON();
		Состояние("Загрузка компоненты записи разговоров CLON");
		КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.сфпКомпонентаCLON", "CLON", ТипВнешнейКомпоненты.Native);
		Если НЕ КодВозврата Тогда
			УстановитьВнешнююКомпоненту("ОбщийМакет.сфпКомпонентаCLON");
			КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.сфпКомпонентаCLON", "CLON", ТипВнешнейКомпоненты.Native);
		КонецЕсли;
		Попытка
			сфпObjCLON = Новый ("AddIn.CLON.DbControl");
		Исключение
			сфпObjCLON = Неопределено;
		КонецПопытки;	
		Если сфпObjCLON = Неопределено Тогда
			Состояние(НСтр("ru='Не удалось загрузить компоненту записи разговоров CLON'"));
			Возврат Ложь;
		КонецЕсли;
		// Проверяем версию подключенной компоненты
		Попытка
			ВерсияКомпонентыCLON = сфпObjCLON.GetVersion();	
		Исключение
			ВерсияКомпонентыCLON = "0.0.0.0";	
		КонецПопытки;	
		Если ВерсияКомпонентыCLON < "1.0.6.0" Тогда
			// Обновляем установленную компоненту
			УстановитьВнешнююКомпоненту("ОбщийМакет.сфпКомпонентаCLON");
			КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.сфпКомпонентаCLON", "CLON", ТипВнешнейКомпоненты.Native);
			Попытка
				сфпObjCLON = Новый ("AddIn.CLON.DbControl");
			Исключение
				сфпObjCLON = Неопределено;
			КонецПопытки;	
			Если сфпObjCLON = Неопределено Тогда
				Состояние(НСтр("ru='Не удалось загрузить компоненту записи разговоров CLON'"));
				Возврат Ложь;
			КонецЕсли;
			// Проверяем версию подключенной компоненты
			Попытка
				ВерсияКомпонентыCLON = сфпObjCLON.GetVersion();	
			Исключение
				ВерсияКомпонентыCLON = "0.0.0.0";	
			КонецПопытки;	
			Если ВерсияКомпонентыCLON < "1.0.6.0" Тогда
				сфпObjCLON = Неопределено;
				Предупреждение(НСтр("ru='Не удалось обновить компоненту записи разговоров CLON. Удалите вручную файл компоненты'")
				+ """SearchModuleNative.dll""" + НСтр("ru=' и перезапустите программу'"));
				Возврат Ложь;
			КонецЕсли;;
		КонецЕсли;	
		// Подключаемся к серверу CLON
		Список = сфпСофтФонПроСервер.сфпПолучитьНастройкиCLON(); 
		Попытка
			КодВозврата = сфпObjCLON.Connect(Список.CLONServerIP, Список.CLONServerPort, Список.CLONType, Список.CLONServerLogin, Список.CLONServerPassword);				
		Исключение
			КодВозврата = -1;
		КонецПопытки;
		Если КодВозврата = -1 Тогда
			сфпCLON = Неопределено;
			Сообщить(НСтр("ru='Проверьте параметры подключения к системе записи телефонных переговоров CLON!'"));
			Возврат Ложь;
		КонецЕсли;	
		Возврат Истина;
	#КонецЕсли
КонецФункции // сфпПодключитьCLON()

// Процедура открывает форму настроек CLON
//
// Параметры:
//	Нет.
//
Процедура сфпНастройкиCLON() Экспорт
	ОткрытьФорму("ОбщаяФорма.сфпФормаНастройкиCLON");
КонецПроцедуры // сфпНастройкиCLON()

// Функция выполняет поиск записей телефонных переговоров
//
// Параметры:
//	СтруктураПоискаCLON	 - Структура	- Структура параметров поиска
//
// Возвращаемое значение:
//	Массив	- Массив структур записей разговоров
//
Функция сфпНайтиЗаписьРазговоровCLON(СтруктураПоискаCLON) Экспорт
	ВремяНачалаЗвонка		= СтруктураПоискаCLON.ВремяНачалаЗвонка;
	ВремяЗавершенияЗвонка	= СтруктураПоискаCLON.ВремяЗавершенияЗвонка;
	НомерА					= СтруктураПоискаCLON.ТелефонА;
	НомерБ					= СтруктураПоискаCLON.ТелефонБ;
	ВходящийИсходящий		= СтруктураПоискаCLON.ВходящийИсходящий;
	Дата1 = Лев(Строка(ВремяНачалаЗвонка), 10);
	Дата2 = Лев(Строка(ВремяЗавершенияЗвонка), 10);
	В1Ч = Строка(Час(ВремяНачалаЗвонка));
	Если СтрДлина(В1Ч) = 1 Тогда 
		В1Ч = "0" + В1Ч;
	КонецЕсли;	
	В1М = Строка(Минута(ВремяНачалаЗвонка));
	Если СтрДлина(В1М) = 1 Тогда 
		В1М = "0" + В1М;
	КонецЕсли;	
	В1С = Строка(Секунда(ВремяНачалаЗвонка));
	Если СтрДлина(В1С) = 1 Тогда 
		В1С = "0" + В1С;
	КонецЕсли;
	Дата1День = День(ВремяНачалаЗвонка);
	Если СтрДлина(Строка(Дата1День)) = 1 Тогда
		Дата1День = "0" + Строка(Дата1День);
	КонецЕсли;	
	Дата1Месяц = Месяц(ВремяНачалаЗвонка);
	Если СтрДлина(Строка(Дата1Месяц)) = 1 Тогда
		Дата1Месяц = "0" + Строка(Дата1Месяц);
	КонецЕсли;
	Дата1Год = Сред(Дата1, 7, 4);
	Дата2День = День(ВремяЗавершенияЗвонка);
	Если СтрДлина(Строка(Дата2День)) = 1 Тогда
		Дата2День = "0" + Строка(Дата2День);
	КонецЕсли;
	Дата2Месяц = Месяц(ВремяЗавершенияЗвонка);
	Если СтрДлина(Строка(Дата2Месяц)) = 1 Тогда
		Дата2Месяц = "0" + Строка(Дата2Месяц);
	КонецЕсли;
	Дата2Год = Сред(Дата2, 7, 4);
	В2Ч = Строка(Час(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2Ч) = 1 Тогда 
		В2Ч = "0" + В2Ч;
	КонецЕсли;	
	В2М = Строка(Минута(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2М) = 1 Тогда 
		В2М = "0" + В2М;
	КонецЕсли;	
	В2С = Строка(Секунда(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2С) = 1 Тогда 
		В2С = "0" + В2С;
	КонецЕсли;	
    Время1 = В1Ч + ":" + В1М + ":" + В1С;
	Время2 = В2Ч + ":" + В2М + ":" + В2С;
	Если Время2 = "00:00:00" Тогда
		Время2 = "23:59:59";
	КонецЕсли;
	ДН = СтрЗаменить(Строка(Дата1Год), " ", "") + "." + Строка(Дата1Месяц) + "." + Строка(Дата1День);
	ДК = СтрЗаменить(Строка(Дата2Год), " ", "") + "." + Строка(Дата2Месяц) + "." + Строка(Дата2День);
	Если ПустаяСтрока(НомерА) Тогда
		НомерА = "";
	КонецЕсли;
	Если ПустаяСтрока(НомерБ) Тогда
		НомерБ = "";
	КонецЕсли;
	МассивCLON = Новый Массив;
	Попытка		
		Список = сфпСофтФонПроСервер.сфпПолучитьНастройкиCLON(); 
		Если Список.CLONType = 1 Тогда
			Если ВходящийИсходящий = ПредопределенноеЗначение("Перечисление.ВходящееИсходящееСобытие.Входящее") Тогда
				Стр = сфпObjCLON.SearchRecord("date,time,duration,number_a,number_b,file", ДН, ДК, Время1, Время2, "", "", "", "", НомерА, "", "", 0, "", 0, 0, 0);
			Иначе
				Стр = сфпObjCLON.SearchRecord("date,time,duration,number_a,number_b,file", ДН, ДК, Время1, Время2, "", "", "", "", "", НомерБ, "", 0, "", 0, 0, 0);
			КонецЕсли;	
		Иначе
			Стр = сфпObjCLON.SearchRecord("date,time,duration,number_a,number_b,file", ДН, ДК, Время1, Время2, "", "", "", "", НомерА, НомерБ, "", 0, "", 0, 0, 0);
		КонецЕсли;	
		Пока НЕ ПустаяСтрока(Стр) Цикл
			НомерВхождения = Найти(Стр, "$");
			Если НомерВхождения = 0 Тогда
				Стр1	= Стр;
				Стр		= "";
			Иначе	
				Стр1	= Лев(Стр, НомерВхождения - 1);
				Стр		= Сред(Стр, НомерВхождения + 1);
			КонецЕсли;		
			СтруктураЗаписи = Новый Структура;
			НомерЗначения = 1;
			Пока НЕ ПустаяСтрока(Стр1) Цикл
				НомерВхождения = Найти(Стр1, "@");
				Если НомерВхождения = 0 Тогда
					Значение	= Стр1;
					Стр1		= "";
				Иначе	
					Значение	= Лев(Стр1, НомерВхождения - 1);
					Стр1		= Сред(Стр1, НомерВхождения + 1);
				КонецЕсли;
				Если НомерЗначения = 1 Тогда
					СтруктураЗаписи.Вставить("date", Значение);
				ИначеЕсли НомерЗначения = 2 Тогда
					СтруктураЗаписи.Вставить("time", Значение);
				ИначеЕсли НомерЗначения = 3 Тогда
					СтруктураЗаписи.Вставить("duration", Значение);
				ИначеЕсли НомерЗначения = 4 Тогда
					СтруктураЗаписи.Вставить("number_a", Значение);
				ИначеЕсли НомерЗначения = 5 Тогда
					СтруктураЗаписи.Вставить("number_b", Значение);
				ИначеЕсли НомерЗначения = 6 Тогда
					СтруктураЗаписи.Вставить("file", Значение);
				КонецЕсли;	
				НомерЗначения = НомерЗначения + 1;
			КонецЦикла;
			МассивCLON.Добавить(СтруктураЗаписи); 
		КонецЦикла;
	Исключение
	КонецПопытки;
	Возврат МассивCLON;
КонецФункции // сфпНайтиЗаписьРазговоровCLON()

// Функция определяет продолжительность разговора
//
// Параметры:
//	ПродолжительностьРазговора	- Строка	- Продолжительность разговора
//
// Возвращаемое значение:
//	Число	- Продолжительность разговора
//
Функция сфпПолучитьПродолжительностьРазговораCLON(ПродолжительностьРазговора) Экспорт
	Попытка
		КоличествоЧасов 	= Число(Лев(ПродолжительностьРазговора, 2));
	Исключение
		КоличествоЧасов 	= 0;
	КонецПопытки;	
	Попытка
		КоличествоМинут 	= Число(Сред(ПродолжительностьРазговора, 4, 2));
	Исключение
		КоличествоМинут 	= 0;
	КонецПопытки;	
	Попытка
		КоличествоСекунд	= Число(Сред(ПродолжительностьРазговора, 7, 2));
	Исключение
		КоличествоСекунд 	= 0;
	КонецПопытки;	
	Возврат 1000 * (КоличествоЧасов * 3600 + КоличествоМинут * 60 + КоличествоСекунд);	
КонецФункции // сфполучитьПродолжительностьРазговораCLON()

// Функция определяет разницу во времении с сервером CLON
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Число	- Смещение времени
//
Функция сфпПолучитьСмещениеВремениCLON() Экспорт
	СмещениеВремениCLON = 0;
	ДатаВремяКомпьютера = сфпСофтФонПроСервер.сфпТекущаяДата();
	Стр = сфпObjCLON.GetCurrentTime();
	Если НЕ ПустаяСтрока(Стр) Тогда
		ВремяКомпьютера = ДатаВремяКомпьютера - НачалоДня(ДатаВремяКомпьютера);
		ВремяСервераCLON = сфпПолучитьПродолжительностьРазговораCLON(Стр) / 1000;
		СмещениеВремениCLON = ВремяСервераCLON - ВремяКомпьютера;
	КонецЕсли;	
	Возврат СмещениеВремениCLON;
КонецФункции // сфпПолучитьСмещениеВремениCLON()
